{
  "</tool_call>": 151658,
  "<answer_end>": 151681,
  "<answer_start>": 151680,
  "<command_end>": 151677,
  "<command_start>": 151676,
  "<ego_end>": 151675,
  "<ego_start>": 151674,
  "<map_end>": 151673,
  "<map_start>": 151672,
  "<question_end>": 151679,
  "<question_start>": 151678,
  "<scene_end>": 151671,
  "<scene_start>": 151670,
  "<tool_call>": 151657,
  "<track_end>": 151667,
  "<track_start>": 151666,
  "<traj_end>": 151669,
  "<traj_start>": 151668,
  "<trajectory>": 151665,
  "<|box_end|>": 151649,
  "<|box_start|>": 151648,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|image_pad|>": 151655,
  "<|object_ref_end|>": 151647,
  "<|object_ref_start|>": 151646,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|repo_name|>": 151663,
  "<|video_pad|>": 151656,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|vision_start|>": 151652
}
